<template>
  <div id="legal_box" class="cont">
    <breadCrumb></breadCrumb>
    <a-layout-content class="legal_cont1">
      <h3>法律声明及使用条款</h3>
      <p>
        若您遵守本使用条款，北京大眼星空科技有限公司即授予您一项个人、非排他性、不可转让、有限的权利以登录并使用本网站。本网站是北京大眼星空科技有限公司的财产。您使用本网站，
        即表示您同意本使用条款；如果您不同意，请勿使用本网站。北京大眼星空科技有限公司保留自行决定在任何时候变更、修改、增加或删除本使用条款部分内容的权利。我们会以适当方式通知您。您在变更信息发布之后继续使用本网站，
        即表示您同意且接受该变更。
      </p>
      <h3>内容</h3>
      <p>
        本网站包含的所有文字、图表、用户界面、可视界面、图片、商标、标识、声音、音乐、美术作品及计算机编码（合称为“内容”），包括但不限于该等内容的设计、结构、选择、协调、表达、“界面外观”及排序等，均属北京大眼星空科技有限公司或其他权利人所有，且受著作权法、专利法、商标法以及各类其他知识产权法等的保护。

        除本使用条款明确规定外，未经北京大眼星空科技有限公司及/或其他权利人事先明确书面同意，您不得为出版或发行或为任何其他商业目的以任何方式（包括“镜像”）将本网站的任何部分及任何内容复制、再制、重印、上传、发布、公开展示、编码、翻译、传输或散布至任何其他计算机、服务器、网站或其他媒介。
      </p>
      <h3>您对本网站的使用</h3>
      <p>
        您不可使用任何“深层链接”、“抓取页面”、“机器人”、“蜘蛛”或其他自动装置、程序、算法、方法或者任何相似或相同的手动程序，以访问、取得、复制或监测本网站任何部分或任何内容，或以任何方式复制或规避本网站或任何内容的导航结构或介绍，通过任何非本网站提供的方式，取得或试图取得任何资料、文件或信息。北京大眼星空科技有限公司有权禁止任何该等行为。

        您不可试图通过非法侵入、“破解”密码或任何其他非法方式，未经授权访问本网站的任何部分或功能，或者链接至本网站或任何北京大眼星空科技有限公司服务器的任何其他系统或网络，或者未经授权取得本网站提供的任何服务。

        您不可探查、扫描或测试本网站或链接至本网站之任何网络的弱点，亦不可违反本网站之任何网络的安全或认证措施。

        您同意不使用任何设备、软件或程序，干扰或试图干扰本网站的正常运行或于本网站进行的任何交易，或干扰或试图干扰他人使用本网站。

        您不可伪造信头或以其他方式操控识别功能，以伪造您通过本网站提交给北京大眼星空科技有限公司的任何信息或传输内容的来源，或者伪造本网站提供的任何服务的来源。您不可假冒他人、或假冒代表他人，或模仿任何其他个人或实体。
      </p>
      <h3>免责声明</h3>
      <p>
        我们会致力于向您提供安全、稳定的优质服务。但是，我们不承诺本网站或本网站的任何内容、服务或功能无任何错误或不中断，或者您对本网站的使用将产生特定结果。本网站及其内容是基于“现状”且“可获得”而提供。本网站提供的所有信息可不经通知而变更。我们不能确保您从本网站下载的任何资料或其他数据无病毒、无污染或不具破坏性。我们不作任何明示或默示保证，包括任何正确性、非侵权、适销性及适用性的保证。对于任何与您对本网站和/或任何北京大眼星空科技有限公司服务的使用有关的任何第三方的作为、不作为和行为，北京大眼星空科技有限公司不承担责任。您对本网站的使用，由您承担全部责任。如果对本网站或任何内容有任何不满意，您可以停止使用本网站或任何该等内容。

        上述免责声明适用于因任何不履行、错误、疏忽、中断、删除、缺陷、操作或传输迟延、电脑病毒、通信线路故障、失窃或破坏或未经授权访问、篡改或使用（无论是违约、侵权、过失或任何其他诉因）而造成的任何损害、责任或伤害。

        北京大眼星空科技有限公司保留在任何时候不经通知进行以下任何行为的权利： （1） 基于任何原因，修改、中止或终止本网站或其任何部分的运行或访问； （2） 修改或变更本网站或其任何部分及任何适用政策或条款；以及 （3）
        在进行定期或非定期维护、错误纠正或其他变更所必须时，中断本网站或其任何部分的运行。
      </p>
      <h3>其他</h3>
      <p>
        若本使用条款的任何条款被享有合法管辖权的法院裁定为无效或不可执行，则该等条款应在最低必要范围内予以限制或排除，并以最能体现本使用条款意图的新条款予以替换，以使本使用条款继续完全有效。

        本使用条款构成您与北京大眼星空科技有限公司之间与您使用本网站相关的整体协议，并在此取代及取消您与锤子商城之间先前存在的与该等使用相关的任何书面或口头协议或理解。

        北京大眼星空科技有限公司没有坚持或强制要求严格履行本使用条款，不应被视为北京大眼星空科技有限公司对任何条款或执行本使用条款的任何权利的放弃，而且北京大眼星空科技有限公司与您或任何其他第三方之间的任何行为不应被视为对本使用条款任何规定的修改。
      </p>
    </a-layout-content>
  </div>
</template>


<script>
  import breadCrumb from "../components/breadCrumb"

  export default {
    data() {
      return {

      }
    },
    components: {
      breadCrumb,
    }
  }

</script>


<style lang="scss">
  @import '~@/assets/scss/_legal';

</style>
